# **SQL METHODS**

In SQL, methods refer to functions or procedures that perform specific tasks within your queries. They are like pre-defined tools that you can use to manipulate, analyze, or interact with your data in various ways.

## Setting Up SQL Environment in Jupyter Notebook

In [1]:
# Enable SQL Extension
%load_ext sql

# Connect to the database
%sql sqlite:///abc-corp.db

### **SELECT**

The SELECT statement in SQL retrieves data from one or more tables, allowing users to specify columns to fetch and apply filters, sorting, and aggregations to manipulate the data returned.

In [ ]:
%sql SELECT * FROM employees;

## DISTINCT

The **DISTINCT** keyword is used to return only distinct (unique) values in the result set of a query. It ensures that duplicate rows are removed from the output.

In [5]:
%%sql
SELECT DISTINCT department
FROM employees;

 * sqlite:///abc-corp.db
Done.

[('IT',), ('Finance',), ('HR',), ('Marketing',), ('Sales',), ('Operations',)]

## LIMIT
The **LIMIT** clause specifies the maximum number of rows to return in a query result.


It's commonly used for:


*   Pagination: Retrieving results in smaller chunks, often used in web applications to display data in pages.
*   Performance optimization: Limiting the number of rows processed, especially for large datasets, can improve query speed.

In [35]:
%%sql 
SELECT * 
FROM employees 
LIMIT 5;

 * sqlite:///abc-corp.db
Done.

[(1, 'Jason', 'Zhu', 'IT', 10000, 5, '2024-04-30'),
 (2, 'Lynn', 'Lin', 'IT', 10000, 5, '2024-04-30'),
 (6, 'Linda', 'Martinez', 'IT', 70000, 4, '2024-04-29'),
 (7, 'Robert', 'Anderson', 'Finance', 65000, 3, '2024-04-30'),
 (8, 'Patricia', 'Taylor', 'HR', 52000, 5, '2024-05-01')]

In [37]:
%%sql 
-- LIMIT(Starting offset, how many records to display)
SELECT * FROM employees
LIMIT 1,2;

 * sqlite:///abc-corp.db
Done.

[(2, 'Lynn', 'Lin', 'IT', 10000, 5, '2024-04-30'),
 (6, 'Linda', 'Martinez', 'IT', 70000, 4, '2024-04-29')]

## COUNT

The **COUNT** function is used to count the number of rows in a table or the number of rows matching a specific condition.

In [19]:
%%sql 
SELECT COUNT(1) 
FROM employees;

 * sqlite:///abc-corp.db
Done.

[(25,)]

In [20]:
%%sql
SELECT COUNT(DISTINCT department)
FROM employees;

 * sqlite:///abc-corp.db
Done.

[(6,)]

In [24]:
%%sql 
SELECT COUNT(first_name) 
FROM employees
WHERE first_name="Jane";

 * sqlite:///abc-corp.db
Done.

[(0,)]

## WHERE

The **WHERE** clause is used to filter data retrieved from a database based on specific conditions.

It allows you to narrow down your results to only include rows that meet certain criteria.

### Comparison Operators:
#### `=:` Equal to

In [26]:
%%sql 
SELECT * 
FROM employees
WHERE performance_rating=3
    AND department in('Sales','Marketing')

 * sqlite:///abc-corp.db
Done.

[(10, 'Jennifer', 'Lee', 'Sales', 63000, 3, '2024-05-03'),
 (15, 'Paul', 'Walker', 'Sales', 61000, 3, '2024-05-08'),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, 3, '2024-05-20')]

#### `!=` : Not equal to

In [30]:
%%sql
SELECT * FROM employees
WHERE department != 'Finance';

 * sqlite:///abc-corp.db
Done.
Done.

[(7, 'Robert', 'Anderson', 'Finance', 65000, 3, '2024-04-30'),
 (13, 'Daniel', 'Clark', 'Finance', 64000, 5, '2024-05-06'),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, 2, '2024-05-11'),
 (23, 'Anthony', 'Scott', 'Finance', 66000, 3, '2024-05-16'),
 (29, 'Ronald', 'Perez', 'Finance', 67000, 5, '2024-05-22')]

#### `<` : Less than

In [ ]:
%%sql
SELECT * FROM employees
WHERE performance_rating<3;

#### `>` : Greater than

In [ ]:
%%sql
SELECT * FROM employees
WHERE performance_rating>3;

#### `<=` : Less than or equal to

In [ ]:
%%sql
SELECT * FROM employees
WHERE performance_rating<=3;

#### `>=` : Greater than or equal to

In [ ]:
%%sql
SELECT * FROM employees
WHERE performance_rating>=3;

### Logical Operators:
#### AND: Used to combine multiple conditions where both must be true.

In [34]:
%%sql
SELECT * FROM employees
WHERE department='Sales'
 AND performance_rating>3;

 * sqlite:///abc-corp.db
Done.

[(21, 'Brian', 'Lopez', 'Sales', 62000, 5, '2024-05-14')]

#### OR: Used to combine multiple conditions where at least one must be true.

In [38]:
%%sql
SELECT * FROM employees
WHERE department = 'Operations' OR department = 'Marketing'

 * sqlite:///abc-corp.db
Done.

[(9, 'Christopher', 'Thomas', 'Marketing', 59000, 2, '2024-05-02'),
 (11, 'James', 'White', 'Operations', 56000, 4, '2024-05-04'),
 (16, 'Karen', 'Hall', 'Marketing', 60000, 4, '2024-05-09'),
 (19, 'George', 'King', 'Operations', 57000, 3, '2024-05-12'),
 (24, 'Deborah', 'Green', 'Marketing', 63000, 4, '2024-05-17'),
 (25, 'Larry', 'Adams', 'Operations', 58000, 5, '2024-05-18'),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, 2, '2024-05-23')]

#### NOT: Used to negate a condition.

In [40]:
%%sql
SELECT * FROM employees
WHERE NOT department = 'Marketing' AND NOT department = 'Finance'

 * sqlite:///abc-corp.db
Done.

[(1, 'Jason', 'Zhu', 'IT', 10000, 5, '2024-04-30'),
 (2, 'Lynn', 'Lin', 'IT', 10000, 5, '2024-04-30'),
 (6, 'Linda', 'Martinez', 'IT', 70000, 4, '2024-04-29'),
 (8, 'Patricia', 'Taylor', 'HR', 52000, 5, '2024-05-01'),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, 3, '2024-05-03'),
 (11, 'James', 'White', 'Operations', 56000, 4, '2024-05-04'),
 (12, 'Barbara', 'Harris', 'IT', 68000, 1, '2024-05-05'),
 (14, 'Nancy', 'Lewis', 'HR', 53000, 2, '2024-05-07'),
 (15, 'Paul', 'Walker', 'Sales', 61000, 3, '2024-05-08'),
 (17, 'Steven', 'Allen', 'IT', 69000, 5, '2024-05-10'),
 (19, 'George', 'King', 'Operations', 57000, 3, '2024-05-12'),
 (20, 'Mary', 'Wright', 'HR', 54000, 4, '2024-05-13'),
 (21, 'Brian', 'Lopez', 'Sales', 62000, 5, '2024-05-14'),
 (22, 'Megan', 'Hill', 'IT', 71000, 2, '2024-05-15'),
 (25, 'Larry', 'Adams', 'Operations', 58000, 5, '2024-05-18'),
 (26, 'Sarah', 'Nelson', 'HR', 55000, 2, '2024-05-19'),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, 3, '2024-05-20'),
 (28, 'Betty', 'Mitchell', 'IT', 72000, 4, '2024-05-21')]

### Special Operators:
#### BETWEEN: Checks if a value falls within a specified range.

In [41]:
%%sql
SELECT * FROM employees
WHERE salary BETWEEN 60000 and 65000;

 * sqlite:///abc-corp.db
Done.

[(7, 'Robert', 'Anderson', 'Finance', 65000, 3, '2024-04-30'),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, 3, '2024-05-03'),
 (13, 'Daniel', 'Clark', 'Finance', 64000, 5, '2024-05-06'),
 (15, 'Paul', 'Walker', 'Sales', 61000, 3, '2024-05-08'),
 (16, 'Karen', 'Hall', 'Marketing', 60000, 4, '2024-05-09'),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, 2, '2024-05-11'),
 (21, 'Brian', 'Lopez', 'Sales', 62000, 5, '2024-05-14'),
 (24, 'Deborah', 'Green', 'Marketing', 63000, 4, '2024-05-17'),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, 3, '2024-05-20'),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, 2, '2024-05-23')]

#### IN: Checks if a value belongs to a set of values.
similar to `=` but it will allow you to select multiple values.

In [42]:
%%sql
SELECT * FROM employees
WHERE first_name IN('Jason','Lynn')

 * sqlite:///abc-corp.db
Done.

[(1, 'Jason', 'Zhu', 'IT', 10000, 5, '2024-04-30'),
 (2, 'Lynn', 'Lin', 'IT', 10000, 5, '2024-04-30')]

#### LIKE: Used for pattern matching with wildcards.

In [44]:
%%sql
SELECT * FROM employees
WHERE last_name like '%son'

 * sqlite:///abc-corp.db
Done.

[(7, 'Robert', 'Anderson', 'Finance', 65000, 3, '2024-04-30'),
 (26, 'Sarah', 'Nelson', 'HR', 55000, 2, '2024-05-19')]

In [47]:
%%sql
SELECT * FROM employees
WHERE first_name like 'j_son'

 * sqlite:///abc-corp.db
Done.

[(1, 'Jason', 'Zhu', 'IT', 10000, 5, '2024-04-30')]

In [49]:
%%sql
SELECT * FROM employees
WHERE first_name = 'Jason'

 * sqlite:///abc-corp.db
Done.

[(1, 'Jason', 'Zhu', 'IT', 10000, 5, '2024-04-30')]

## ORDER BY

The **ORDER BY** clause allows you to sort the results of your SELECT queries in either ascending or descending order. It lets you sort the retrieved data based on one or more columns, making it easier to analyze and interpret.

**ASC:** Ascending order (lowest to highest).

In [50]:
%%sql
SELECT * FROM employees
ORDER BY last_name ASC;

 * sqlite:///abc-corp.db
Done.

[(25, 'Larry', 'Adams', 'Operations', 58000, 5, '2024-05-18'),
 (17, 'Steven', 'Allen', 'IT', 69000, 5, '2024-05-10'),
 (7, 'Robert', 'Anderson', 'Finance', 65000, 3, '2024-04-30'),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, 3, '2024-05-20'),
 (13, 'Daniel', 'Clark', 'Finance', 64000, 5, '2024-05-06'),
 (24, 'Deborah', 'Green', 'Marketing', 63000, 4, '2024-05-17'),
 (16, 'Karen', 'Hall', 'Marketing', 60000, 4, '2024-05-09'),
 (12, 'Barbara', 'Harris', 'IT', 68000, 1, '2024-05-05'),
 (22, 'Megan', 'Hill', 'IT', 71000, 2, '2024-05-15'),
 (19, 'George', 'King', 'Operations', 57000, 3, '2024-05-12'),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, 3, '2024-05-03'),
 (14, 'Nancy', 'Lewis', 'HR', 53000, 2, '2024-05-07'),
 (2, 'Lynn', 'Lin', 'IT', 10000, 5, '2024-04-30'),
 (21, 'Brian', 'Lopez', 'Sales', 62000, 5, '2024-05-14'),
 (6, 'Linda', 'Martinez', 'IT', 70000, 4, '2024-04-29'),
 (28, 'Betty', 'Mitchell', 'IT', 72000, 4, '2024-05-21'),
 (26, 'Sarah', 'Nelson', 'HR', 55000, 2, '2024-05-19'),
 (29, 'Ronald', 'Perez', 'Finance', 67000, 5, '2024-05-22'),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, 2, '2024-05-23'),
 (23, 'Anthony', 'Scott', 'Finance', 66000, 3, '2024-05-16'),
 (8, 'Patricia', 'Taylor', 'HR', 52000, 5, '2024-05-01'),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, 2, '2024-05-02'),
 (15, 'Paul', 'Walker', 'Sales', 61000, 3, '2024-05-08'),
 (11, 'James', 'White', 'Operations', 56000, 4, '2024-05-04'),
 (20, 'Mary', 'Wright', 'HR', 54000, 4, '2024-05-13'),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, 2, '2024-05-11'),
 (1, 'Jason', 'Zhu', 'IT', 10000, 5, '2024-04-30')]

**DESC:** Descending order (highest to lowest).

In [ ]:
%%sql
SELECT * FROM employees
ORDER BY salary DESC;

### Sorting multiple columns

In [ ]:
%%sql
SELECT * FROM employees
ORDER BY department ASC, Salary DESC

In [53]:
%%sql
SELECT * FROM employees
ORDER BY performance_rating ASC, Salary DESC

 * sqlite:///abc-corp.db
Done.

[(12, 'Barbara', 'Harris', 'IT', 68000, 1, '2024-05-05'),
 (22, 'Megan', 'Hill', 'IT', 71000, 2, '2024-05-15'),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, 2, '2024-05-23'),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, 2, '2024-05-11'),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, 2, '2024-05-02'),
 (26, 'Sarah', 'Nelson', 'HR', 55000, 2, '2024-05-19'),
 (14, 'Nancy', 'Lewis', 'HR', 53000, 2, '2024-05-07'),
 (23, 'Anthony', 'Scott', 'Finance', 66000, 3, '2024-05-16'),
 (7, 'Robert', 'Anderson', 'Finance', 65000, 3, '2024-04-30'),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, 3, '2024-05-20'),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, 3, '2024-05-03'),
 (15, 'Paul', 'Walker', 'Sales', 61000, 3, '2024-05-08'),
 (19, 'George', 'King', 'Operations', 57000, 3, '2024-05-12'),
 (28, 'Betty', 'Mitchell', 'IT', 72000, 4, '2024-05-21'),
 (6, 'Linda', 'Martinez', 'IT', 70000, 4, '2024-04-29'),
 (24, 'Deborah', 'Green', 'Marketing', 63000, 4, '2024-05-17'),
 (16, 'Karen', 'Hall', 'Marketing', 60000, 4, '2024-05-09'),
 (11, 'James', 'White', 'Operations', 56000, 4, '2024-05-04'),
 (20, 'Mary', 'Wright', 'HR', 54000, 4, '2024-05-13'),
 (17, 'Steven', 'Allen', 'IT', 69000, 5, '2024-05-10'),
 (29, 'Ronald', 'Perez', 'Finance', 67000, 5, '2024-05-22'),
 (13, 'Daniel', 'Clark', 'Finance', 64000, 5, '2024-05-06'),
 (21, 'Brian', 'Lopez', 'Sales', 62000, 5, '2024-05-14'),
 (25, 'Larry', 'Adams', 'Operations', 58000, 5, '2024-05-18'),
 (8, 'Patricia', 'Taylor', 'HR', 52000, 5, '2024-05-01'),
 (1, 'Jason', 'Zhu', 'IT', 10000, 5, '2024-04-30'),
 (2, 'Lynn', 'Lin', 'IT', 10000, 5, '2024-04-30')]

## GROUP BY

The **GROUP BY** clause is used to organize and summarize data by grouping rows with the same values in one or more columns. This helps you analyze trends, patterns, and aggregate statistics within your data.

### Grouping with COUNT()

In [54]:
%%sql
SELECT department,COUNT(1) AS employee_count
FROM employees
GROUP BY department;

 * sqlite:///abc-corp.db
Done.

[('Finance', 5),
 ('HR', 4),
 ('IT', 7),
 ('Marketing', 4),
 ('Operations', 3),
 ('Sales', 4)]

### Grouping with SUM()

In [56]:
%%sql
SELECT department
 ,SUM(salary) AS total_salary
 ,COUNT(1) AS employee_count
FROM employees
GROUP BY department;

 * sqlite:///abc-corp.db
Done.

[('Finance', 324000, 5),
 ('HR', 214000, 4),
 ('IT', 370000, 7),
 ('Marketing', 247000, 4),
 ('Operations', 171000, 3),
 ('Sales', 250000, 4)]

### Grouping with AVG()

In [58]:
%%sql
SELECT department
 ,AVG(salary) AS avg_salary
 ,COUNT(1) AS employee_count
FROM employees
GROUP BY department

 * sqlite:///abc-corp.db
Done.

[('Finance', 64800.0, 5),
 ('HR', 53500.0, 4),
 ('IT', 52857.142857142855, 7),
 ('Marketing', 61750.0, 4),
 ('Operations', 57000.0, 3),
 ('Sales', 62500.0, 4)]

### Grouping with MAX() and MIN()

In [59]:
%%sql
SELECT department
 ,MAX(salary) AS max_salary
 ,MIN(salary) AS min_salary
FROM employees
GROUP BY department

 * sqlite:///abc-corp.db
Done.

[('Finance', 67000, 62000),
 ('HR', 55000, 52000),
 ('IT', 72000, 10000),
 ('Marketing', 65000, 59000),
 ('Operations', 58000, 56000),
 ('Sales', 64000, 61000)]

In [60]:
%%sql
SELECT *
FROM employees
WHERE salary=
(
    SELECT MIN(salary)
    FROM employees
);

 * sqlite:///abc-corp.db
Done.

[(1, 'Jason', 'Zhu', 'IT', 10000, 5, '2024-04-30'),
 (2, 'Lynn', 'Lin', 'IT', 10000, 5, '2024-04-30')]

In [66]:
%%sql
SELECT * FROM employees
WHERE salary = 
(
    SELECT MAX(salary)
    FROM employees
);

 * sqlite:///abc-corp.db
Done.

[(28, 'Betty', 'Mitchell', 'IT', 72000, 4, '2024-05-21')]